
public class text {
//  버전관리 시스템
//  프로그램의 사본을 생성, 보존, 복원을 한번에 관리해 주는 시스템
//  
//  버전관리 모델 2가지
//  1. 클라이언트-서버모델
//  CVS : 서버클라이언트 모델로 모든작업과 모든변화를 추적하고 여러 개발자가 협력하여 작업을 할 수 
//       있게 하는 것
//  SVN : 
//  2. 분산모델
//  GIT : 분산모델로 여러명의 개발자가 특정 프로젝트를 자신의 컴퓨터로 혈업하면서
//       버전관리를 할 수 있게 하는 시스템
//  특징 : 로컬 및 원격저장소 생성, 로컬 저장소에 파일 생성 및 추가, 수정내역을 관리할 수 있음
//      원본파일에 영향을 미치지 않는 브렌치 (작업장)를 생성하여 별도로 프로젝트를 관리할 수 있음
//      원본파일(master)과 브런치 파일을 합쳐서(merge) 최신본을 생성할 수 있음
//      같은코드를 수정한 것에 대한 충돌처리 가능
//  
//  
//  
//  내하드 로컬레파지토리
//  원격 리모트레파지토리
	
}
